In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Data Acquisition Exercises

## 4 Iris Seaborn

Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = sns.load_dataset('iris')

- print the first 3 rows

In [3]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

- print the column names

In [5]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

- print the data type of each column

In [6]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

- print the summary statistics for each of the numeric variables

In [7]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## 5 Telco Google Sheet

Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

Make sure that the spreadsheet is publicly visible under your sharing settings.

In [8]:
telco_churn_url = 'https://docs.google.com/spreadsheets/d/1enPPia450yfCCPnve1Dj77mWCBzq59mmJPLAvzPnmQo/edit#gid=1023018493'
telco_churn_url = telco_churn_url.replace('/edit', '/export?format=csv')

df_google_sheets = pd.read_csv(telco_churn_url)
df_google_sheets.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,total_charges_clean,monthly_charges_bins,payment_type_automatic,services,payment_type_electronic,has_internet_service,tenure,tenure_bins,phone_with_internet,churn_retain
0,1371-DWPAZ,Female,0,Yes,Yes,0,1,2,Credit card (automatic),56.05,...,0.0,40 - 60,automatic,Phone or Internet,electronic,Internet,0,0 - 1 year,No Phone,Retained
1,2520-SGTTA,Female,0,Yes,Yes,1,0,2,Mailed check,20.00,...,0.0,0 - 20,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained
2,2775-SEFEE,Male,0,No,Yes,2,1,2,Bank transfer (automatic),61.90,...,0.0,60 - 80,automatic,Phone and Internet,electronic,Internet,0,0 - 1 year,Phone and Internet,Retained
3,2923-ARZLG,Male,0,Yes,Yes,1,0,1,Mailed check,19.70,...,0.0,0 - 20,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained
4,3115-CZMZD,Male,0,No,Yes,1,0,2,Mailed check,20.25,...,0.0,20 - 40,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained

- assign the first 100 rows to a new dataframe, df_google_sheets_sample

In [9]:
df_google_sheets_sample = df_google_sheets.head(100)

- print the number of rows of your original dataframe

In [10]:
df_google_sheets.shape[0]

7049

- print the first 5 column names

In [11]:
df_google_sheets.columns[ : 5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

- print the column names that have a data type of object

In [12]:
# list(df_google_sheets.select_dtypes('object'))
# will also get only object types and put them in a list

df_google_sheets.dtypes[df_google_sheets.dtypes == 'object']

customer_id                object
gender                     object
partner                    object
dependents                 object
payment_type               object
churn                      object
monthly_charges_bins       object
payment_type_automatic     object
services                   object
payment_type_electronic    object
has_internet_service       object
tenure_bins                object
phone_with_internet        object
churn_retain               object
dtype: object

- compute the range for each of the numeric variables.

In [13]:
# df_google_sheets.select_dtypes('number').apply(...)
# Using select_dtypes

numeric_columns = df_google_sheets.dtypes[df_google_sheets.dtypes != 'object']
df_google_sheets[numeric_columns.index].apply(lambda column: column.max() - column.min())

is_senior_citizen         1.0
phone_service             2.0
internet_service          2.0
contract_type             2.0
monthly_charges         100.5
total_charges          8666.0
total_charges_clean    8684.8
tenure                   79.0
dtype: float64

## 6 Telco Excel

Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [14]:
df_excel = pd.read_excel('TelcoCustDetails.xlsx')
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,total_charges_clean,monthly_charges_bins,payment_type_automatic,services,payment_type_electronic,has_internet_service,tenure,tenure_bins,phone_with_internet,churn_retain
0,1371-DWPAZ,Female,0.0,Yes,Yes,0.0,1.0,2.0,Credit card (automatic),56.05,...,0.0,40 - 60,automatic,Phone or Internet,electronic,Internet,0,0 - 1 year,No Phone,Retained
1,2520-SGTTA,Female,0.0,Yes,Yes,1.0,0.0,2.0,Mailed check,20.00,...,0.0,0 - 20,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained
2,2775-SEFEE,Male,0.0,No,Yes,2.0,1.0,2.0,Bank transfer (automatic),61.90,...,0.0,60 - 80,automatic,Phone and Internet,electronic,Internet,0,0 - 1 year,Phone and Internet,Retained
3,2923-ARZLG,Male,0.0,Yes,Yes,1.0,0.0,1.0,Mailed check,19.70,...,0.0,0 - 20,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained
4,3115-CZMZD,Male,0.0,No,Yes,1.0,0.0,2.0,Mailed check,20.25,...,0.0,20 - 40,non-automatic,Phone or Internet,non-electronic,No Internet,0,0 - 1 year,Phone and No Internet,Retained

- assign the first 100 rows to a new dataframe, df_excel_sample

In [15]:
df_excel_sample = df_excel.head(100)

- print the number of rows of your original dataframe

In [16]:
df_excel.shape[0]

7049

- print the first 5 column names

In [17]:
df_excel.columns[ : 5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

- print the column names that have a data type of object

In [18]:
df_excel.dtypes[df_excel.dtypes == 'object']

customer_id                object
gender                     object
partner                    object
dependents                 object
payment_type               object
churn                      object
monthly_charges_bins       object
payment_type_automatic     object
services                   object
payment_type_electronic    object
has_internet_service       object
tenure_bins                object
phone_with_internet        object
churn_retain               object
dtype: object

- compute the range for each of the numeric variables.

In [19]:
numeric_columns = df_google_sheets.dtypes[df_google_sheets.dtypes != 'object']
df_google_sheets[numeric_columns.index].apply(lambda column: column.max() - column.min())

is_senior_citizen         1.0
phone_service             2.0
internet_service          2.0
contract_type             2.0
monthly_charges         100.5
total_charges          8666.0
total_charges_clean    8684.8
tenure                   79.0
dtype: float64

## 7 Train Google Sheet

Read the data from this google sheet into a dataframe, df_google.
https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357

In [20]:
train_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
train_url = train_url.replace('/edit', '/export?format=csv')

df_google = pd.read_csv(train_url)

- print the first 3 rows

In [21]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- print the number of rows and columns

In [22]:
df_google.shape

(891, 12)

- print the column names

In [23]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

- print the data type of each column

In [24]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- print the summary statistics for each of the numeric variables

In [25]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- print the unique values for each of your categorical variables

In [26]:
categorical_columns = ['Survived', 'Pclass', 'SibSp', 'Parch', 'Sex', 'Embarked']
df_google[categorical_columns].apply(lambda column: column.unique())

Survived                   [0, 1]
Pclass                  [3, 1, 2]
SibSp       [1, 0, 3, 4, 2, 5, 8]
Parch       [0, 1, 2, 5, 3, 4, 6]
Sex                [male, female]
Embarked           [S, C, Q, nan]
dtype: object

# Data Preparation Exercises

In [27]:
from acquire import *

## Iris Data:

- Use the function defined in acquire.py to load the iris data.

In [28]:
iris = get_iris_data()
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

In [29]:
# Checking for null values

iris.isnull().sum()

species_id        0
measurement_id    0
sepal_length      0
sepal_width       0
petal_length      0
petal_width       0
species_name      0
dtype: int64

- Drop the species_id and measurement_id columns.

In [30]:
iris = iris.drop(columns = ['species_id', 'measurement_id'])
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

- Rename the species_name column to just species.

In [31]:
iris = iris.rename(columns = {'species_name' : 'species'})
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

- Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [32]:
dummy_df = pd.get_dummies(iris[['species']], dummy_na = False, drop_first = ['True'])
dummy_df.head()

   species_versicolor  species_virginica
0                   0                  0
1                   0                  0
2                   0                  0
3                   0                  0
4                   0                  0

In [33]:
iris = pd.concat([iris, dummy_df], axis = 1)
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0

- Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [34]:
def prep_iris_data(df):
    df = df.drop(columns = ['species_id', 'measurement_id'])
    df = df.rename(columns = {'species_name' : 'species'})
    dummy_df = pd.get_dummies(df[['species']], dummy_na = False, drop_first = ['True'])
    df = pd.concat([df, dummy_df], axis = 1)
    return df

In [35]:
prep_iris_data(get_iris_data()).head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0

## Titanic dataset

- Use the function defined in acquire.py to load the Titanic data.

In [36]:
titanic = get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [37]:
# Checking for null values

titanic.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

- Drop any unnecessary, unhelpful, or duplicated columns.

In [38]:
titanic.shape[0]

891

In [39]:
titanic = titanic.drop_duplicates()
titanic.shape[0]

891

In [40]:
cols_to_drop = ['deck', 'embarked', 'class', 'age']
titanic = titanic.drop(columns=cols_to_drop)
titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1

In [41]:
titanic['embark_town'] = titanic.embark_town.fillna(value='Southampton')
titanic.isnull().sum()

passenger_id    0
survived        0
pclass          0
sex             0
sibsp           0
parch           0
fare            0
embark_town     0
alone           0
dtype: int64

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [42]:
dummy_df = pd.get_dummies(titanic[['sex','embark_town']], dummy_na=False, drop_first=[True, True])
titanic = pd.concat([titanic, dummy_df], axis=1)
titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,4,0,3,male,0,0,8.0500,Southampton,1,1,0,1

- Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [43]:
def prep_titanic_data(df):
    df = df.drop_duplicates()
    cols_to_drop = ['deck', 'embarked', 'class', 'age']
    df = df.drop(columns=cols_to_drop)
    df['embark_town'] = df.embark_town.fillna(value='Southampton')
    dummy_df = pd.get_dummies(df[['sex','embark_town']], dummy_na=False, drop_first=[True, True])
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [44]:
prep_titanic_data(get_titanic_data()).head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,4,0,3,male,0,0,8.0500,Southampton,1,1,0,1

## Telco dataset

- Use the function defined in acquire.py to load the Telco data.

In [45]:
telco = get_telco_data()
telco.head()

,contract_type_id,internet_service_type_id,payment_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,payment_type,internet_service_type,contract_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,Mailed check,DSL,One year
1,1,1,2,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Mailed check,DSL,Month-to-month
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Electronic check,Fiber optic,Month-to-month
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Electronic check,Fiber optic,Month-to-month
4,1,2,2,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Mailed check,Fiber optic,Month-to-month

- Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [46]:
telco.shape[0]

7043

In [47]:
telco = telco.drop_duplicates()
telco.shape[0]

7043

In [48]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   contract_type_id          7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   payment_type_id           7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  payment_type              7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  contract_type             7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [49]:
telco.describe()

,contract_type_id,internet_service_type_id,payment_type_id,senior_citizen,tenure,monthly_charges
count,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000
mean,1.690473,1.872923,2.315633,0.162147,32.371149,64.761692
std,0.833755,0.737796,1.148907,0.368612,24.559481,30.090047
min,1.000000,1.000000,1.000000,0.000000,0.000000,18.250000
25%,1.000000,1.000000,1.000000,0.000000,9.000000,35.500000
50%,1.000000,2.000000,2.000000,0.000000,29.000000,70.350000
75%,2.000000,2.000000,3.000000,0.000000,55.000000,89.850000
max,3.000000,3.000000,4.000000,1.000000,72.000000,118.750000

In [50]:
telco.describe(exclude = 'number')

,customer_id,gender,partner,dependents,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,total_charges,churn,payment_type,internet_service_type,contract_type
count,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043,7043
unique,7043,2,2,2,2,3,3,3,3,3,3,3,2,6531,2,4,3,3
top,0002-ORFBO,Male,No,No,Yes,No,No,No,No,No,No,No,Yes,,No,Electronic check,Fiber optic,Month-to-month
freq,1,3555,3641,4933,6361,3390,3498,3088,3095,3473,2810,2785,4171,11,5174,2365,3096,3875

In [51]:
for col in telco.select_dtypes(include = 'object'):
    print(telco[col].value_counts())
    print('-----------------------')

0002-ORFBO    1
6616-AALSR    1
6625-UTXEW    1
6625-IUTTT    1
6625-FLENO    1
             ..
3352-RICWQ    1
3352-ALMCK    1
3351-NQLDI    1
3351-NGXYI    1
9995-HOTOH    1
Name: customer_id, Length: 7043, dtype: int64
-----------------------
Male      3555
Female    3488
Name: gender, dtype: int64
-----------------------
No     3641
Yes    3402
Name: partner, dtype: int64
-----------------------
No     4933
Yes    2110
Name: dependents, dtype: int64
-----------------------
Yes    6361
No      682
Name: phone_service, dtype: int64
-----------------------
No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64
-----------------------
No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64
-----------------------
No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64
-----------------------
No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64
-----------------------
No                     3473
Yes                    2044
No internet service    1526
Name: tech_support, dtype: int64
-----------------------
No                     2810
Yes                    2707
No internet service    1526
Name: streaming_tv, dtype: int64
-----------------------
No                     2785
Yes                    2732
No internet service    1526
Name: streaming_movies, dtype: int64
-----------------------
Yes    4171
No     2872
Name: paperless_billing, dtype: int64
-----------------------
           11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: total_charges, Length: 6531, dtype: int64
-----------------------
No     5174
Yes    1869
Name: churn, dtype: int64
-----------------------
Electronic check             2365
Mailed check                 1612
Bank transfer (automatic)    1544
Credit card (automatic)      1522
Name: payment_type, dtype: int64
-----------------------
Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64
-----------------------
Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64
-----------------------

We can drop contract_type_id, internet_service_type_id, and payment_type_id since these are all foreign keys.
<br>
We can customer_id since this does not provide any useful information.

In [52]:
cols_to_drop = [
    'customer_id',
    'contract_type_id',
    'internet_service_type_id',
    'payment_type_id'
]
telco = telco.drop(columns = cols_to_drop)

In [53]:
list(telco.columns)

['customer_id',
 'gender',
 'senior_citizen',
 'partner',
 'dependents',
 'tenure',
 'multiple_lines',
 'online_security',
 'online_backup',
 'device_protection',
 'tech_support',
 'streaming_tv',
 'streaming_movies',
 'paperless_billing',
 'monthly_charges',
 'total_charges',
 'churn',
 'payment_type',
 'internet_service_type',
 'contract_type']

The total_charges column has some empty cells.

In [ ]:
# We could simply drop these rows from the dataframe

telco.total_charges = telco.total_charges.str.strip()
telco = telco[telco.total_charges != '']

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [54]:
# customer_id and total_charges are not categorical columns

categorical_cols = telco.dtypes[telco.dtypes == 'object'].index
categorical_cols = categorical_cols.drop(labels = ['customer_id', 'total_charges'])
list(categorical_cols)

['gender',
 'partner',
 'dependents',
 'multiple_lines',
 'online_security',
 'online_backup',
 'device_protection',
 'tech_support',
 'streaming_tv',
 'streaming_movies',
 'paperless_billing',
 'churn',
 'payment_type',
 'internet_service_type',
 'contract_type']

In [55]:
dummy_df = pd.get_dummies(telco[categorical_cols], dummy_na = False, drop_first = True)
telco = pd.concat([telco, dummy_df], axis = 1)
telco.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check,internet_service_type_Fiber optic,internet_service_type_None,contract_type_One year,contract_type_Two year
0,0002-ORFBO,Female,0,Yes,Yes,9,No,No,Yes,No,...,0,1,0,0,0,1,0,0,1,0
1,0003-MKNFE,Male,0,No,No,9,Yes,No,No,No,...,1,0,0,0,0,1,0,0,0,0
2,0004-TLHLJ,Male,0,No,No,4,No,No,No,Yes,...,0,1,1,0,1,0,1,0,0,0
3,0011-IGKFF,Male,1,Yes,No,13,No,No,Yes,Yes,...,1,1,1,0,1,0,1,0,0,0
4,0013-EXCHZ,Female,1,Yes,No,3,No,No,No,No,...,0,1,1,0,0,1,1,0,0,0

In [ ]:
# # For binary categorical values this might be better

# telco['partner_encoded'] = telco.partner.map({'Yes' : 1, 'No' : 0})
# telco['dependents_encoded'] = telco.dependents.map({'Yes' : 1, 'No' : 0})
# ...

- Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [56]:
def prep_telco_data(df):
    df = df.drop_duplicates()
    cols_to_drop = [
        'phone_service',
        'contract_type_id',
        'internet_service_type_id',
        'payment_type_id'
    ]
    df = df.drop(columns = cols_to_drop)
    categorical_cols = df.dtypes[df.dtypes == 'object'].index
    categorical_cols = categorical_cols.drop(labels = ['customer_id', 'total_charges'])
    dummy_df = pd.get_dummies(df[categorical_cols], dummy_na = False, drop_first = True)
    df = pd.concat([df, dummy_df], axis = 1)
    return df